
# tap repositories and their packages

tap 'homebrew/core'
brew 'asciiquarium'
brew 'bat'
brew 'berkeley-db'
brew 'brotli'
brew 'c-ares'
brew 'ca-certificates'
brew 'exa'
brew 'fontconfig'
brew 'freetype'
brew 'gdbm'
brew 'gettext'
brew 'gh'
brew 'ghostscript'
brew 'git'
brew 'htop'
brew 'icu4c'
brew 'jbig2dec'
brew 'jpeg-turbo'
brew 'libevent'
brew 'libidn'
brew 'libidn2'
brew 'libnghttp2'
brew 'libpng'
brew 'libtiff'
brew 'libunistring'
brew 'libuv'
brew 'little-cms2'
brew 'lz4'
brew 'mas'
brew 'mpdecimal'
brew 'ncurses'
brew 'neofetch'
brew 'node'
brew 'openjpeg'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'pcre2'
brew 'perl'
brew 'python@3.10'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'screenresolution'
brew 'sqlite'
brew 'tmux'
brew 'utf8proc'
brew 'wget'
brew 'xz'
brew 'zstd'

tap 'homebrew/cask-fonts'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-meslo-lg-nerd-font'

tap 'homebrew/cask-versions'
cask 'iterm2-beta'

tap 'homebrew/cask'
cask 'asana'
cask 'cemu'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'linearmouse'
cask 'mactex-no-gui'
cask 'raycast'
cask 'rectangle'
cask 'shottr'
cask 'slack'
cask 'slidepilot'
cask 'spotify'
cask 'steam'
cask 'telegram-desktop'
cask 'visual-studio-code'
cask 'whatsapp'

tap 'rcmdnk/file'
brew 'brew-file'

# App Store applications
mas 'Bitwarden (2023.1.1)', id: 1352778147
mas 'GarageBand (10.4.7)', id: 682658836
mas 'iMovie (10.3.5)', id: 408981434
mas 'Keynote (12.2.1)', id: 409183694
mas 'Numbers (12.2.1)', id: 409203825
mas 'Pages (12.2.1)', id: 409201541
