
# tap repositories and their packages

tap 'homebrew/core'
brew 'asciiquarium'
brew 'bat'
brew 'exa'
brew 'git'
brew 'htop'
brew 'neofetch'
brew 'reattach-to-user-namespace'
brew 'tmux'
brew 'wget'

tap 'homebrew/cask-fonts'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-meslo-lg-nerd-font'

tap 'homebrew/cask'
cask 'asana'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'mactex-no-gui'
cask 'raycast'
cask 'rectangle'
cask 'shottr'
cask 'slack'
cask 'slidepilot'
cask 'spotify'
cask 'telegram-desktop'
cask 'visual-studio-code'
cask 'whatsapp'

# Other Cask applications
cask 'iterm2-beta'
